root-2.3.0/run/MicroChannelFoam/beta-MicroChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    AirInlet
    {
        type            patch;
        nFaces          10;
        startFace       5870;
    }
    WaterInlet
    {
        type            patch;
        nFaces          20;
        startFace       5880;
    }
    ChannelWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       5900;
    }
    Outlet
    {
        type            patch;
        nFaces          30;
        startFace       6100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6000;
        startFace       6130;
    }
)

// ************************************************************************* //
