root-2.3.0/run/MicroChannelFoam/beta-MicroChannel/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;


// Baffles to create.
baffles
{
    baffleFaces
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    downerInletWall;

        //- Optional flip
        //flip        false;

        patches
        {
            master
            {
                //- Master side patch
                name            downerInletWall;
                type            wall;

                patchFields
                {
                    p
                    {
                        type            zeroGradient;
                    }
                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }
                    alpha.water
                    {
                        type            zeroGradient;
                    }
                }
            }
            slave
            {
                //- Slave side patch
                name            downerInletWall-shadow;
                $master;
            }
        }
    }

baffleFaces
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    upperInletWall;

        //- Optional flip
        //flip        false;

        patches
        {
            master
            {
                //- Master side patch
                name            upperInletWall;
                type            wall;

                patchFields
                {
                    p
                    {
                        type            zeroGradient;
                    }
                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }
                    alpha.water
                    {
                        type            zeroGradient;
                    }
                }
            }
            slave
            {
                //- Slave side patch
                name            upperInletWall-shadow;
                $master;
            }
        }
    }
}


// ************************************************************************* //
