root-2.3.0/run/MicroChannelFoam/beta-MicroChannel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    downerInletWall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 4.49e-5 0)(0.0001 4.5e-5 0.1e-5);
        }
    }

    {
        name    downerInletWall;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet downerInletWall;
        }
    }

    {
        name    upperInletWall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 5.5e-5 0)(0.0001 5.51e-5 0.1e-5);
        }
    }

    {
        name    upperInletWall;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet upperInletWall;
        }
    }
);

// ************************************************************************* //
